[
    {
        "page": 1,
        "data": [
            {
                "header": "The Magic Wheel",
                "date": "July 28, 2022",
                "user": "Admin ",
                "tags": "fun, travel, trends",
                "responses": "1",
                "text": "It's not it to understand them in the objects we're playing. Products fulfilling a product more innovative, bullets grunts, powerful or stay at every multivariate spacetime point of analysis. People have enormous serial correlation. Good design is derived from so deep and then there's no other product useful.",
                "img": "https://picsum.photos/id/1031/250/200"
            },
            {
                "header": "The lonely road",
                "date": "July 17, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "3",
                "text": "Many of the content, and often about their precious turfpossessed selves and principles are shortcomings of seeing and colors to cover up a paucity of design. Zero out your interface. I think that are deep and profound indeed, these tasks and showing.",
                "img": "https://picsum.photos/id/1033/250/200"
            },
            {
                "header": "I love gasoline smell",
                "date": "July 16, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "2",
                "text": "Many of the content, and often about their precious turfpossessed selves and principles are shortcomings of seeing and colors to cover up a paucity of design. Zero out your interface. I think that are deep and profound indeed, these tasks and showing.",
                "img": "https://picsum.photos/id/1048/250/200"
            }
        ]
    },
    {
        "page": 2,
        "data": [
            {
                "header": "Comparing Node JavaScript to JavaScript in the Browser",
                "date": "July 15, 2022",
                "user": "Admin",
                "tags": "javaScript, NodeJs, web design",
                "responses": "3",
                "text": "If you've mainly written JavaScript that runs in the browser and you're looking to get more of an understanding of the server side, many articles will tell you that Node JavaScript is a great way to write server-side code and capitalize on your JavaScript experience.",
                "img": "https://picsum.photos/id/238/250/200"
            },
            {
                "header": "How To Use The Vite Build Tool with React",
                "date": "July 14, 2022",
                "user": "User",
                "tags": "react, travel, web design",
                "responses": "11",
                "text": "Vite is hot, in part, because it's based on esbuild and wickedly fast. It's from Evan You of Vue fame, but it's not a Vue-specific tool. Here, NARUHODO covers how to configure it to work with React.",
                "img": "https://picsum.photos/id/182/250/200"
            },
            {
                "header": "When a Click is Not Just a Click",
                "date": "July 13, 2022",
                "user": "User",
                "tags": "html, travel, web design",
                "responses": "7",
                "text": "The click event is quite simple and easy to use you listen for the event and run code when the event is fired. It works on just about every HTML element there is, a core feature of the DOM API.",
                "img": "https://picsum.photos/id/283/250/200"
            }
        ]
    },
    {
        "page": 3,
        "data": [
            {
                "header": "A Lightweight Masonry Solution",
                "date": "July 10, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "5",
                "text": "Back in May, I learned about Firefox adding masonry to CSS grid. Masonry layouts are something I've been wanting to do on my own from scratch for a very long time, but have never known where to start. So, naturally, I checked the demo and then I had a lightbulb moment when I understood how this new proposed CSS feature works.",
                "img": "https://picsum.photos/id/1047/250/200"
            },
            {
                "header": "The Cost of Javascript Frameworks",
                "date": "July 10, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "0",
                "text": "I expect this post from Tim Kadlec to be quoted in every performance conference talk for the next few years. There is a lot of data here, so please check it out for yourself, but the short story is that JavaScript-framework-powered sites are definitely heavier and more resource-intensive than non-JavaScript-framework-powered sites.",
                "img": "https://picsum.photos/id/1060/250/200"
            },
            {
                "header": "A Guide to Handling Browser Events",
                "date": "June 12, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "0",
                "text": "In this post, Sarah Chima walks us through how we can work with browser events, such as clicking, using JavaScript. There's a ton of great info in here! If JavaScript isn't your strong suit, I think this is the best explanation of event handling that I've read in quite some time.",
                "img": "https://picsum.photos/id/1065/250/200"
            }
        ]
    },
    {
        "page": 4,
        "data": [
            {
                "header": "Building an Images Gallery using PixiJS and WebGL",
                "date": "June 10, 2022",
                "user": "Admin",
                "tags": "fun, dd, web design",
                "responses": "9",
                "text": "Sometimes, we have to go a little further than HTML, CSS, and JavaScript to create the UI we need, and instead use other resources, like SVG, WebGL, canvas, and others.",
                "img": "https://picsum.photos/id/1067/250/200"
            },
            {
                "header": "let vs. const",
                "date": "July 16, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "0",
                "text": "There are multiple ways to declare variables in JavaScript. We had var, and while that still works like it always has, it is generally said that let and const are replacements to the point we rarely (if ever) need var anymore. This doodle explanation does a pretty good job, if you need a refresher.",
                "img": "https://picsum.photos/id/1076/250/200"
            },
            {
                "header": "Understanding Async Await",
                "date": "July 16, 2022",
                "user": "Admin",
                "tags": "fun, travel, web design",
                "responses": "0",
                "text": "When writing code for the web, eventually you'll need to do some process that might take a few moments to complete. JavaScript can't really multitask, so we'll need a way to handle those long-running processes.",
                "img": "https://picsum.photos/id/1075/250/200"
            }
        ]
    },
    {
        "page": 5,
        "data": [
            {
                "header": "What is super() in JavaScript?",
                "date": "May 25, 2022",
                "user": "Admin",
                "tags": "fun, dd, web design",
                "responses": "5",
                "text": "What's happening when you see some JavaScript that calls super()?.In a child class, you use super() to call its parent's constructor and super.<methodName> to access its parent's methods. This article will assume at least a little familiarity with the concepts of constructors and child and parent classes. If that's totally new, you may want to start with Mozilla's article on Object-oriented JavaScript for beginners.",
                "img": "https://picsum.photos/id/1078/250/200"
            },
            {
                "header": "Working with Attributes on DOM Elements",
                "date": "May 16, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "3",
                "text": "The DOM is just a little weird about some things, and the way you deal with attributes is no exception. There are a number of ways to deal with the attributes on elements. By attributes, I mean things like the id in <div id='cool'></div>. Sometimes you need to set them. Sometimes you need to get them. Sometimes there are fancy helper APIs. Sometimes there isn't.",
                "img": "https://picsum.photos/id/134/250/200"
            },
            {
                "header": "Level up your .sort game",
                "date": "May 15, 2022",
                "user": "User",
                "tags": "fun, travel, web design",
                "responses": "8",
                "text": "Sorting is a super handy JavaScript method that can display the values of an array in a certain order. Whether that's real estate listings by price, burger joints by distance, or best nearby happy hours by rating, sorting arrays of information is a common need.",
                "img": "https://picsum.photos/id/1081/250/200"
            }
        ]
    }
]